"""Задания по стилю кода и именованию переменных."""

# напиши команду, которая проверяет, ссылаются ли
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None

if id(spam) == id(eggs):
    print('the same object!')
else:
    print('not the same')


# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым
active_students_list = []

# назови переменную, которая хранит текущее количество студентов в потоке
currenst_students_count

# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45
 max_inrange = 45
 min_inrange = 1

# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
PI = 3.1415926535